"""
Здравствуйте, использовал только те функции, которые изучили(без функций и классов). Поэтому так все некрасиво :)
"""
print("Доброго времени суток!")
d = dict()
while True:
	function = input("1.Ввести нового пользователя\n2.Удалить пользователя по username\n3.Обновить данные пользователя\n4.Вывести полный список\nДля выхода введите 'выход'\n")
	if function == "1": #добавить нового пользователя (лучше делать через классы)
		try:
			username = str(input("Введите имя пользователя: "))
			height = float(input("Рост в метрах ?: "))
			weight = int(input("Вес в килограммах ? : ")) 
			age = int(input("Сколько лет ?: "))
			sex = str(input("Пол ?: "))
		except ValueError: print("=========================================\nВы ввели не правильно! Попробуйте снова!\n=========================================")
		else: 
			d[username] = {"Рост" : height, "Вес" : weight, "Возраст" : age, "Пол" : sex}
			bmi = weight / (height ** 2) #def bmi
			temp = round(((bmi - 20) / 30) * 10)
			if bmi > 50: 
				d[username]["BMI"] = "20" + "="* 10 + "|50"
				d[username]["Рекомендации"] = "Меньше кушай"
			elif bmi < 20: 
				d[username]["BMI"] = "20|" + "="* 10 + "50"
				d[username]["Рекомендации"] = "Больше кушай"
			else: 
				d[username]["BMI"] = "20" + "="* temp + "|" + "="* (10 - temp) + "50"
				d[username]["Рекомендации"] = "Кушай здоровую пищу"
			print("=========================================\nСоздан новый пользователь: " + username + "\n=========================================")
	elif function == "2": #удалить пользователя
		tempname = str(input("Введите пользователя, которого надо удалить: "))
		if tempname in d: 
			print("=========================================\nУдален пользователь под именем: " + tempname + "\n=========================================") 
			del(d[tempname])  
		else: print("=========================================\nТакого юзера нету! Попробуйте снова!\n=========================================")
	elif function == "3": #изменение параметров
		tempusername = input("Имя пользователя которого меняем: ")
		if tempusername in d:
			while True:
				tempvalue = input("Введите 'Рост' 'Вес' 'Возраст' 'Пол': ")
				if tempvalue == "Рост" or tempvalue == "Вес" or tempvalue == "Возраст" or tempvalue == "Пол":  break 
				else: print("Попробуйте еще раз")
			while True:
				tempvalue2 = input("Введите новое значение: ")
				d[tempusername][tempvalue] = tempvalue2
				try:
					float(d[tempusername]["Рост"])
					int(d[tempusername]["Вес"])
					int(d[tempusername]["Возраст"])
				except ValueError: print("Неверный тип данных! Попробуйте еще раз!")
				else: break
			if tempvalue == "Рост" or tempvalue == "Вес": 
				bmi = int(d[tempusername]["Вес"]) / (float(d[tempusername]["Рост"]) ** 2) #def bmi
				temp = round(((bmi - 20) / 30) * 10)
				if bmi > 50: 
					d[tempusername]["BMI"] = "20" + "="* 10 + "|50"
					d[tempusername]["Рекомендации"] = "Меньше кушай"
				elif bmi < 20: 
					d[tempusername]["BMI"] = "20|" + "="* 10 + "50"
					d[tempusername]["Рекомендации"] = "Больше кушай"
				else: 
					d[tempusername]["BMI"] = "20" + "="* temp + "|" + "="* (10 - temp) + "50"
					d[tempusername]["Рекомендации"] = "Кушай здоровую пищу"
			print("=========================================\nУдачно!\n=========================================")
		else: print("=========================================\nТакого юзера нету! Попробуйте снова!\n=========================================")
	elif function == "4": #вывод всех значений
		print("===================================================================================")
		print("Имя\tРост\tВес\tВозраст\tПол\tBMI\t\t\tРекомендации")
		for key in d.keys():
			print(key + "\t" + str(d[key]["Рост"]) + "\t" + str(d[key]["Вес"]) + "\t" + str(d[key]["Возраст"]) + "\t" + str(d[key]["Пол"]) + "\t" + str(d[key]["BMI"]) + "\t\t" + str(d[key]["Рекомендации"]))
		print("===================================================================================")
	elif function == "выход":	#выход
		print("=========================================\nВсего доброго!\n=========================================") 
		break
	else: print("=========================================\nВы ввели не правильно! Попробуйте снова!\n=========================================")	