print("Доброго времени суток!")
d = dict()
while True:
	function = input("1.Ввести нового пользователя\n2.Удалить пользователя по username\n3.Обновить данные пользователя\n4.Вывести полный список\nДля выхода введите 'выход'\n")
	if function == "1": #добавить нового пользователя
		try:
			username = str(input("Введите имя пользователя: "))
			height = float(input("Рост в метрах ?: "))
			weight = int(input("Вес в килограммах ? : ")) 
			age = int(input("Сколько лет ?: "))
			sex = str(input("Пол ?: "))
		except ValueError: print("=========================================\nВы ввели не правильно! Попробуйте снова!\n=========================================")
		else: 
			d[username] = {"Рост" : height, "Вес" : weight, "Возраст" : age, "Пол" : sex}
			bmi = weight / (height ** 2) 
			temp = round(((bmi - 20) / 30) * 10)
			if bmi > 50: 
				d[username]["BMI"] = "20" + "="* 10 + "|50"
			elif bmi < 20: 
				d[username]["BMI"] = "20|" + "="* 10 + "50"
			else: 
				d[username]["BMI"] = "20" + "="* temp + "|" + "="* (10 - temp) + "50"
			print("=========================================\nСоздан новый пользователь: " + username + "\n=========================================")
	elif function == "2": #удалить пользователя
		tempname = str(input("Введите пользователя, которого надо удалить: "))
		if tempname in d: 
			print("=========================================\nУдален пользователь под именем: " + tempname + "\n=========================================") 
			del(d[tempname])  
		else: print("=========================================\nТакого юзера нету! Попробуйте снова!\n=========================================")
	elif function == "3": #изменение параметров
		pass
	elif function == "4": #вывод
		print("=========================================")
		print("Имя\tРост\tВес\tВозраст\tПол\tBMI")
		for key in d.keys():
			print(key, end = "\t")
			for value in d[key].values():
				print(str(value), end="\t")
			print()
		print("=========================================")
	elif function == "выход":	
		print("=========================================\nВсего доброго!\n=========================================") 
		break #выход
	else: print("=========================================\nВы ввели не правильно! Попробуйте снова!\n=========================================")	